#include <msp430x14x.h>
#include "display.h"
#include "config.h"
#include "global.h"
#include "gui.h"
#include "fft.h"
#include "ILI9325.h"
#include "interface.h"
#include "math.h"

#define NUM  128
#define H_NUM NUM/2
// log2(N)
#define SERIES 7

#define PI 3.1415926
#define PI_TWO 2.0 * 3.141592653

Complex data[NUM + 1];

char flag = 0;

int count = 0;

// set up twiddle constants in factor 
Complex const factor[H_NUM] = {
    {1.000000, -0.000000}, {0.998795, -0.0490677}, {0.995185, -0.0980171}, {0.989177, -0.146730},
    {0.980785, -0.195090}, {0.970031, -0.2429800}, {0.956940, -0.2902850}, {0.941544, -0.336890},
    {0.923880, -0.382683}, {0.903989, -0.4275550}, {0.881921, -0.4713970}, {0.857729, -0.514103},
    {0.831470, -0.555570}, {0.803208, -0.5956990}, {0.773010, -0.6343930}, {0.740951, -0.671559},
    {0.707107, -0.707107}, {0.671559, -0.7409510}, {0.634393, -0.7730100}, {0.595699, -0.803208},
    {0.555570, -0.831470}, {0.514103, -0.8577290}, {0.471397, -0.8819210}, {0.427555, -0.903989},
    {0.382683, -0.923880}, {0.336890, -0.9415440}, {0.290285, -0.9569400}, {0.242980, -0.970031},
    {0.195090, -0.980785}, {0.146730, -0.9891770}, {0.0980172, -0.995185}, {0.0490677, -0.998795},
    {0.000000, -1.000000}, {-0.0490676, -0.998795},{-0.0980171, -0.995185},{-0.14673, -0.989177},
    {-0.19509, -0.980785}, {-0.242980, -0.970031}, {-0.290285, -0.956940}, {-0.33689, -0.941544},
    {-0.382683, -0.92388}, {-0.427555, -0.903989}, {-0.471397, -0.881921}, {-0.514103,-0.857729},
    {-0.55557, -0.831470}, {-0.595699, -0.803208}, {-0.634393, -0.773010}, {-0.671559, -0.740951},
    {-0.707107, -0.707107},{-0.740951, -0.671559}, {-0.773010, -0.634393}, {-0.803208,-0.595699},
    {-0.83147, -0.555570}, {-0.857729, -0.514103}, {-0.881921, -0.471397}, {-0.903989, -0.427555},
    {-0.92388, -0.382683}, {-0.941544, -0.336890}, {-0.956940, -0.290285}, {-0.970031, -0.24298},
    {-0.980785, -0.19509}, {-0.989177, -0.146731}, {-0.995185, -0.0980172},{-0.998795, -0.0490677}
};


void Init_Clk(void)
{
    uint delay;
    BCSCTL1 &= ~XT2OFF;                    // XT2OFF:控制XT2振荡器的开启(XT2OFF=0)
    BCSCTL2 |= SELM_2 + SELS;               //SELS:选择SMCLK的时钟源,0:DCOCLK;1:XT2CLK.   
    for(delay=5000;delay>0;delay--);	   //SELM0~1:选择MCLK的时钟源,0,1:DCOCLK,2:XT2CLK,3:LFXT1CLK
            IFG1 &=~OFIFG;      			   //晶振故障中断标志位  
    TACCR0=0XFFFF; 
  
}

//*************************************************************************
//	ADC初始化程序，用于配置ADC相关寄存器
//*************************************************************************
void ADC_Init()
{
  P6SEL|=0x01;                                    //选择ADC通道
  ADC12CTL0|= ADC12ON + MSC + SHT0_8; //ADC电源控制开，16个CLK，内部基准2.5V
  ADC12CTL1|= SHP + CONSEQ1;            //SMCLK做时钟源
  ADC12MCTL0= SREF0 + INCH_0;                     //参考控制位及通道选择，这里选择通道0
  ADC12IE|= 0x01;                                 //中断允许
  ADC12CTL0|= ENC;                                //使能转换器
}

//*************************************************************************
//	ADC中断服务程序
//*************************************************************************
#pragma vector=ADC_VECTOR
__interrupt void ADC12ISR(void)
{
    (data + count)->real = ADC12MEM0 * 1.0;                     //读取ADC转换值 
    ++count;
    if (count > 128) {
        count = 128;
        flag = 1;
    }
    P6OUT &= ~0x80;
}

void main(void) 																  
{	
    int value;
    int i;
    WDTCTL = WDTPW + WDTHOLD;    // 关闭看门狗 
    Clock_Init();	//时钟初始化
    DelayMs(50);  
    ADC_Init();     //初始化ADC配置
    delay_ms(100);  //延时100ms
    InitPort();     //彩屏端口初始化
    P6DIR |= 0x80;
    P6OUT |= 0x80;
    
    ILI9325_initial();    //液晶初始化程序
    DelayMs(50);
    
    /**
    int i;
    for (i = 0; i < 128; i++) {
        (data + i)->real = (float)2 + 3 * cos (2 * PI * 50 * i / 256 - PI * 30 / 180) 
                                     + 1.5 * cos (2 * PI * 75 * i / 256 + PI * 90 / 180);
    }
    */
    GUI_clearscreen(WHITE);
    _EINT(); //使能中断
    ADC12CTL0 |= ADC12SC;
    // _BIS_SR(LPM3 + GIE);//进入低功耗模式
    while(1)
    {
        if(flag == 1) {
            P6OUT |= 0x80;
            //ADC12CTL0 |= ADC12SC;           //开启转换
            //ADC12CTL0 &= ~ADC12SC;          //清零
            FFT(data, factor, NUM, SERIES);
        
            GUI_clearscreen(WHITE);
            //MAIN_WINDOW();
            
            for (i = 0; i < 64; i++) {
                value = (int)sqrt(  
                                (data + i)->real * (data + i)->real 
                                + (data + i)->imag * (data + i)->imag
                             ) / 128;
                if (value > 240) value = 240;
                GUI_box(0, i * 5, value, i * 5 + 3, 0x001f);//画实心矩形
            }
            flag = 0;
            count = 0;
        }
    }
    
}